# Описати функцію IsPrime (N) логічного типу, яка повертає True,
# якщо цілий параметр N (> 1) є простим числом, і False в іншому випадку (число, більше 1, називається простим, якщо воно не має позитивних дільників, крім 1 і самого себе).
# Дано набір з 10 цілих чисел, більших 1. За допомогою функції IsPrime знайти кількість простих чисел в даному наборі.

def IsPrime(N):
    D = 2
    while N % D != 0:
        D += 1
    return D == N

var = 0

while var != 10:
    i = int(input("Enter a number: "))
    print(IsPrime(i))
    var = var + 1;