# 6. Дано ціле число в діапазоні 1-7.
# Вивести рядок - назва дня тижня, що відповідає даному числу
# (1 - «понеділок», 2 - «вівторок» і т. д.).

# Добровольський Павло, 132 група, ФКНФМ

day = int(input("Введите число в диапазоне 1-7: "))
if day==1:
    print("Сегодня понедельник.")
if day==2:
    print("Сегодня вторник.")
if day==3:
    print("Сегодня среда.")
if day==4:
    print("Сегодня четверг.")
if day==5:
    print("Сегодня пятница.")
if day==6:
    print("Сегодня суббота.")
if day==7:
    print("Сегодня воскресенье.")
if day>7:
    print("Нет такого дня недели.")