#1. Дана сторона квадрата a. Знайти його периметр P = 4·a.
# Добровольський Павло, 132 група, ФКНФМ

a = float(input("Enter a: "))
p = 4 * a
print(p)