#2. Дана сторона квадрата a. Знайти його площу S=a^2.
# Добровольський Павло, 132 група, ФКНФМ

a = float(input("Enter a: "))
S = a * a
print(S)