# Описати функцію DegToRad (D) дійсного типу, яка знаходить величину кута в
#радіанах, якщо дана його величина D в градусах (D - дійсне число, 0 ≤ D <360).
#Скористатися таким співвідношенням: 180 ° = π радіанів. Як значення π
#вважати рівним 3.14. За допомогою функції DegToRad перевести з градусів в
#радіани п'ять даних кутів.

def DegToRad(D):
    
    if 0 >= D or D > 360:
        print("Incorrect form")
    else:
        return D/180*3.14

var = 5
while var != 0:
    D = float(input("Enter D - "))
    print(DegToRad(D))
    var = var - 1
